docs/state_machines/dot/ru/cloudcomputing/state_Access.dot
digraph {
  rankdir=LR;
  node [shape=oval];
  edge [fontsize=10];

  created [label="новый"];
  approved [label="доступ одобрен"];
  prepared_to_finish [label="подготовлен к завершению"];
  prepared_to_deny [label="подготовлен к завершению администратором"];
  denied [label="отказано в доступе"];
  finished [label="завершён"];
  __initial [shape=point];
  __initial -> created;
  created -> approved [label="approve"];
  approved -> prepared_to_finish [label="prepare_to_finish"];
  approved -> prepared_to_deny [label="prepare_to_deny"];
  prepared_to_finish -> finished [label="finish"];
  prepared_to_deny -> denied [label="deny"];
}
